Revit 2027 API
WallSweepInfo.DefaultSetback Property
 The sweep setback distance from inserts, such as windows and doors.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DefaultSetback { get; set; }
Public Property DefaultSetback As Double
	Get
	Set
public:
property double DefaultSetback {
	double get ();
	void set (double value);
}
member DefaultSetback : float with get, set
Property Value
Double
See Also
Reference
WallSweepInfo Class
Autodesk.Revit.DB Namespace